import React, { Component } from 'react';

import { StyleSheet,AsyncStorage,ScrollView ,View} from 'react-native';
import {  Header,  Image, Text,
   Button, Icon,Switch , ListItem,
 Checkbox ,Box  } from 'native-base';

import { Actions } from 'react-native-router-flux';
export default class Rolls extends Component {
  constructor() {
    super();
    this.state = { checked: false };

  }

  setcheckbox(){
    console.log('the checkbox is checked again');
  this.setState({checked: !this.state.checked});

  }

  goTomainPage(){
    AsyncStorage.setItem('id_visitbefore', 'true');
    Actions.Main();
  }

  renderGobutton(){
    if(this.state.checked){
      return(
        <Button block success onPress={() => this.goTomainPage()} >
           <Text>شروع</Text>
         </Button>
      )
    }else{
      return(
        <Button block success disabled>
           <Text>شروع</Text>
         </Button>
      )
    }
  }
  render() {
    return (
      <ScrollView>
          <View style={{flex: 0}}>
            <Box>
              <Box>
                <Image source={{uri: 'Image URL'}} />
                <Box>
                  <Text style={{fontFamily:'IRAN Sans',}}>قوانین و توافق نامه کاربری</Text>
                <Text note style={{fontFamily:'IRAN Sans',}}>برای استفاده بهتر از اپلیکیشن آجر</Text>
                </Box>
              </Box>
            </Box>
            <Box>
              <Box>
                <Image source={require('../login/images/payment-method.png')}  style={{height: 200, width: 200,alignSelf:'center'}}/>
              <Text style={styles.rollstext}>


                1. توافق نامه
                سایت آجر شامل بخشهای متعدد و متنوع می باشد که سعی شده است خدمات گوناگونی را به کاربران ارائه نماید. و لذا کلیه کاربران باید قبل ازهر گونه استفاده و یا درج آگهی در سایت نسبت به قبول کلیه موارد توافق نامه و قوانین کاربری که در ادامه خواهد آمد اقدام نمایند.
                سایت آجر در قبال صحت و سلامتی کلیه آگهی هائی که برای معاملات در آن انتشار می یابند هیچ گونه مسئولیتی نداشته و کاربران هنگام خرید و فروش باید از صحت و درستی کیفیت و کمیت املاک و هویت طرف مقابل اطمینان حاصل نمایند.
                انتشار هر گونه اگهی در سایت تابع قوانین و مقررات از لحاظ هزینه ها و رعایت حقوق سایر کاربران می باشد.
                معاملاتی که خرید و فروش از طریق شرکت انجام شود تابع قوانین و مقررات مربوطه بوده و در این صورت امنیت و ایمنی معامله بر عهده شرکت ولی صحت کمیت و کیفیت کالا بر عهده کاربر می باشد.
                کلیه پیشنهادات کاربران برای انجام معامله از طریق شرکت به عنوان اطلاعات شرکتی محسوب شده و دسترسی مستقیم سایر کاربران به آن مقدور نبوده و شرکت بر اساس پیشنهاد دریافتی ، آکهی متناسب و مربوط با آن را مطابق با منافع و اهداف خود انتشار خواهد داد.
                واحد پولی کلیه هزینه های اعلام شده در سایت برای استفاده از خدمات آجر بر اساس تومان می باشد.
                2.قوانین کاربری
                کاربران هنگام استفاده از سایت باید متوجه باشند که پذیرش کلیه شرایط و مقررات مندرج در ذیل اجباری بوده و کاربر باید بدون هیچ گونه قید و شرطی آنها را قبول کرده و حق هیچ گونه اعتراضی را نخواهد داشت و این قوانین شامل قسمت های مالی و حقوقی می باشد.
                2.1 قوانین حقوقی کاربری
                انتشار آگهی توسط کاربران یا استفاده از آگهی های انتشار یافته به هر نحو به مفهوم آن است که کاربر با رعایت و قبول کلیه قوانین و مقررات حاکم بر سایت اقدام نموده و بعدا حق هیچ گونه اعتراضی مبنی بر عدم اطلاع را نخواهد داشت.
                آجر در قبال صحت و درستی آگهی های درج شده در سایت هیچ گونه مسئولیتی ندارد و کاربران باید قبل از انجام هر گونه معامله و پیش پرداخت از صحت و درستی املاکها از نظر کمیت و کیفیت و یا هویت طرف مقابل اطمینان حاصل نمایند.
                آجر صرفا انتشار دهنده آگهی برای اطلاع دیگران است و هیچ گونه مسئولیتی در قبال سوءاستفاده از این آگهی ها که ممکن است توسط کاربران به هر شکل و روشی انجام شود نخواهد داشت.
                کلیه موارد مندرج در بخش توافق نامه کاربری بر اساس قوانین و مقررات جمهوری اسلامی ایران تنظیم گردیده است و اگر در موارد خاص احتمالا اختلافی بین این دو وجود داشته باشد بدیهی است که قوانین و مقررات جاری کشور ملاک عمل خواهد بود.
                مسئولیت هر لینک و مطلب از سایت که از طریق اشخاص حقیقی یا حقوقی دیگر در شبکه های اجتماعی و یا سایر رسانه ها انتشار یابد بر عهده سایت آجر نبوده و افراد منتشر کننده این مطالب و موضوعات شامل هر گونه عواقب کیفری و مالی خواهند بود.
                نظر به اینکه اداره سایت و کنترل و بهره برداری از آن و نیز دسته بندی پیام ها و انجام خدمات نگهداری ، هزینه بردار می باشد لذا کاربران و استفاده کنندگان باید هزینه های مربوط را پرداخت نمایند بنابراین هزینه ان بخش که رایگان نمی باشد توسط کاربران پرداخت خواهد شد و این هزینه ها ممکن است در هر دوره زمانی مطابق با شرایط بوجود امده دچار تغییر شود.
                تداوم در بهره برداری از یک شبکه و کنترل آن بستگی به عوامل و فاکتور های متعددی دارد که در بیشتر اوقات عوامل و شرایط خارج از کنترل ما بوده و لذا امکان دارد در این گونه موارد سایت دچار اخلال و قطع سرویس احتمالی در بهره برداری گردد و در این صورت سایت مسئولیتی نداشته و نخواهد داشت.  هرچند سعی و تلاش ما و کلیه همکاران بر ان است که این سایت بلاوقفه و به صورت دائمی در اختیار کاربران باشد.
                کاربران و استفاده کنندگان از سایت آجر نمی توانند آگهی های انتشار یافته در سایت را به هر صورت نوشتاری و یا تصویری و یا غیره و یا به صورت دستی و یا اتوماتیک کپی برداری کرده و مورد استفاده قرار دهند و این موارد پیگیری قانونی در پی خواهد داشت.
                انجام هر گونه ویرایش و تغییر در اگهی های انتشار یافته که خلاف قانون و مقررات و شئونات باشد ممنوع است و نیز ساخت و درج اگهی های جعلی با استفاده سخت افزار و نرم افزار های ویژه در شبکه آجر اکیدا ممنوع بوده و موجب پیگیری قانونی خواهد شد.
                استفاده از مطالب و اگهی های انتشار یافته در آجر در شبکه و سایت های دیگر فقط با اخذ مجوز کتبی مجاز بوده و در غیر این صورت باعث ایجاد حق قانونی جهت پیگرد و درخواست ضرر و زیان خواهد شد.
                ایرابست نمیتواند هیچ گونه کنترلی روی کیفیت ، کمیت و استاندارد و یا قانونی بودن کالا برای انجام معامله داشته باشد . لذا هیچ گونه مسئولتی در هیچ موردی نخواهد داشت مگر انکه معامله از طریق شرکت بازرگانی و خدماتی فراگستر جامع آسیا انجام شود و این سایت صرفا محلی برای تبلیغ کالای شما برای خرید یا فروش یا معاوضه میباشد.
                استفاده کاربران از امکاناتی که توسط آجر در اختیار انان قرار گیرد صرفا خدماتی بوده و دلیلی بر تایید صحت و سلامتی کیفیت و کمیت کالا و با هویت و اعتبار کاربر نخواهد بود.
                سایت آجر مجاز است هر گونه اگهی کاربران را قبل از درج در سایت در اختیار اعضا و مشتریانی که دارای امتیاز و کد ویزیتوری و عضویت و یا اشتراک میباشند قرار دهد ، تا روند انجام معامله تسریع و امکانات بیشتری در اختیار خریداران کالا قرار گیرد . بدیهی است که در این صورت هم سایت مسئولیتی در هیچ زمینه ای نخواهد داشت و طرفین معامله باید قبل از انجام معامله از هر نظر اطمینان کامل را حاصل نمایند.
                کاربرانی که موفق به دریافت کد ویزیتوری ، اشتراک و عضویت از سایت می شوند حق خاص ویژه ای نداشته و به هیچ عنوان نماینده و یا کارمند شرکت محسوب نخواهند شد.
                در صورت نیاز به تغییر بندهای این توافق نامه ، قوانین جاری و حاکم کشور ملاک عمل خواهد بود.




                3.آجر یک  فعال مجازی در زمینه معاملات املاک است و ثبت هر گونه آگهی که به این دسته بندی مرتب نباشد راتایید نخواهد کرد


  </Text>
              </Box>
            </Box>

          </View>
          <View>
            {this.renderGobutton()}
          </View>
          <View>
            <Checkbox
    title='قوانین و مقررات آجر را قبول دارم'
    checked={this.state.checked}
    onPress={() => this.setcheckbox()}
  />
          </View>

        </ScrollView>
    );
  }
}


const styles = StyleSheet.create({

  rollstext:{
    textAlign:'right',
    justifyContent: 'center',
    alignItems: 'center',
    fontFamily:'IRAN Sans',
  },

});
