import React, { Component } from 'react';

import { Image,StyleSheet,AsyncStorage } from 'react-native';
import { Container, Header, Content, Card, CardItem, Thumbnail, Text, Button, Icon,Right, Left,Switch , Body,ListItem,   } from 'native-base';
import { CheckBox } from 'react-native-elements';
import { Actions } from 'react-native-router-flux';
export default class Firstbootrolls extends Component {
  constructor() {
    super();
    this.state = { checked: false };

  }

  setcheckbox(){
  this.setState({checked: !this.state.checked});

  }

  goTomainPage(){
    AsyncStorage.setItem('id_visitbefore', 'true');
    Actions.main();
  }

  renderGobutton(){
    if(this.state.checked){
      return(
        <Button block success onPress={() => this.goTomainPage()} >
           <Text>شروع</Text>
         </Button>
      )
    }else{
      return(
        <Button block success disabled>
           <Text>شروع</Text>
         </Button>
      )
    }
  }
  render() {
    return (
      <Container>
        <Header />
        <Content>
          <Card style={{flex: 0}}>
            <CardItem>
              <Left>
                <Thumbnail source={{uri: 'Image URL'}} />
                <Body>
                  <Text>قوانین و مقررات</Text>
                <Text note>برای استفاده بهتر از اپلیکیشن ایرابیست</Text>
                </Body>
              </Left>
            </CardItem>
            <CardItem>
              <Body>
                <Image source={require('../login/images/payment-method.png')}  style={{height: 200, width: 200,alignSelf:'center'}}/>
              <Text style={styles.rollstext}>

شرایط ثبت آگهی:
در نظر داشته باشید، به منظور تسهیل و تسریع فرآیند انتشار آگهی‌ها، ایرابیست ممکن است در مواردی بر اساس قوانین، متن یا عنوان آگهی شما را به طور جزئی تغییر دهد. همچنین ایرابیست مجاز است هرگونه پیام، آگهی و یا عکسی که به این سایت ارسال می‌کنید یا هر حساب کاربری و اطلاعات دیگری که مربوط به شما یا ایجاد شده توسط شما باشد را هر زمان و به هر شکلی که ضروری بداند حذف نماید.

 چنانچه از ناحیه مراجع ذیصلاح قانونی دستور حذف آگهی صادر شده باشد، ایرابیست فوراً اقدام به حذف آگهی می‌نماید. همچنین در صورتی که گزارش تخلف کاربران نسبت به آگهی بیشتر از 5 مورد باشد، ایرابیست به صلاحدید خود ممکن است اقدام به حذف آگهی نماید. در دو فرض اخیر ایرابیست هیچ‌گونه مسئولیتی در قبال بازپرداخت هزینه‌های پرداختی بابت آگهی حذف شده به کاربر ندارد.

آگهی‌دهندگان با ثبت آگهی خود در ایرابیست تأیید می‌کنند که آگهی ایشان شامل مواردی که در ادامه آورده می‌شوند نخواهد بود و همچنین دارای سن بالای ۱۸ سال هستند.

مغایرت با قوانین جاری جمهوری اسلامی ایران و عرف جامعه،
ناقض حریم شخصی افراد،
آگهی‌های فروشی بدون تصویر در بخش‌های «مربوط به خانه» و «شخصی»،
استفاده از عبارت‌ها یا کلماتی مانند: خریدار، فروش، ویژه، رند، مفت، ارزان، نو، زیر قیمت، استثنائی، گوشی، حراج و موارد مشابه،
درج قیمت در عنوان آگهی،
هر گونه توهین به ادیان رسمی کشور، آداب، رسوم، قومیت‌ها، لهجه‌ها و گویش‌های مختلف،
استفاده ابزاری از تصاویر اشخاص در آگهی، درج بی‌مورد عکس صورت اشخاص یا استفاده از عکس کودکان برای معرفی کالا و خدماتی که مخاطب آن کودکان نیستند،
استفاده از حروف و زبان انگلیسی برای آگهی‌های فارسی،
هر نوع آگهی و خبرپراکنی سیاسی، اجتماعی یا مذهبی که جنبه تجاری نداشته باشد،
برنامه‌ها و روش‌های عبور از فیلترینگ، VPN و خدمات یا کالاهای مربوط به نصب آنتن، راه اندازی ماهواره یا اینترنت ماهواره‌ای،
ابزار یا آموزش‌های نفوذ، خرابکاری، شکستن قفل، هک و کرک،
فروش برنامه‌های نرم‌افزاری یا کتاب‌های فاقد مجوز قانونی برای انتشار و سایر موارد ناقض «قانون حمایت حقوق مؤلفان و مصنفان و هنرمندان»،
هر گونه اجاره و فروش فیلم یا موسیقی،
شبکه‌های هرمی و فعالیت‌های غیرقانونی و غیرمجاز اقتصادی مشابه،
هر نوع مسابقه، قرعه‌کشی و بخت‌آزمایی (با جایزه یا بدون جایزه)،
آگهی انجام پروژه‌های دانشجویی و دانش آموزی،
هر گونه کالایی که موجب رواج خشونت و آسیب رساندن به دیگران می‌شود، مانند: سلاح‌های گرم و سرد، مواد محترقه و امثال آن،
کالا و خدمات مرتبط با مواد مخدر، سیگار یا ترک اعتیاد،
فروش دستگاه فلزیاب، گنج‌یاب، حفاری غیرمجاز یا لوازم و تجهیزات مرتبط با آن،
خدمات مرتبط با همسریابی، دوست‌یابی، مشاوره خانوادگی،
آگهی‌هایِ محرمیت، صیغه و ازدواج،
خدمات، دفاتر و شرکت‌های مرتبط با لیزینگ به جز نمایندگی‌های مجاز با ارائه مجوز،
فروش فاکتور و پیش فاکتور برای اخذ وام، حذف سهم بیمه کارفرما و مشابه آن،
هرگونه خدمات مرتبط با گرین‌کارت یا اقامت کشورها و مسافرت و اخذ ویزا به کشورهایی که منع قانونی برای ورود به آن‌ها وجود دارد،
خرید و فروش فیش حج عمره و تمتع،
خرید و فروش اعضای بدن، مانند:‌ «کلیه»،
درخواست کمک‌های نقدی یا پیش‌پرداخت برای معامله‌های از راه دور،
درج شماره حساب در متن آگهی،
خدمات و کالاهایی که شائبه کلاهبرداری در آن مشاهده شود،
معرفی سایت‌، کالا یا خدماتی که به هر شکلی قصد رقابت با ایرابیست را دارند،
خرید و فروش حیوانات، پرندگان و خزندگان وحشی و گوشت‌خوار،
خرید و فروش مواد غذایی، تقویتی و مکمل‌های ورزشی،
نصب برنامه‌های جانبی موبایل و ویندوز،
پنل پیامک انبوه،
درج آگهی‌های دوره‌های آموزشی بدون قراردادن اطلاعاتی در مورد مدرس،
درج آگهی‌ خودروهای غیر قابل خرید و فروش در ایران،
درج مکرر آگهی‌‌های یکسان حتی با عناوین متفاوت در یک روز،
ارسال مجدد یک آگهی‌‌ که از زمان حذف آن توسط کاربر، بیش از ۲۴ ساعت سپری نشده باشد،
قرار ملاقات غیرتجاری به صورت آنلاین،
وجود جملات نادرست از نظر املائی یا نگارشی و
آگهی‌های فروش سیم کارت که شمارهٔ آن در عنوانِ آگهی درج نشده باشد.
هرگونه اشاره به شبکه‌های اجتماعی مانند تلگرام و یا اینستاگرام در بخش توضیحات به جز در دسته‌بندی خدمات
هرگونه سوءاستفاده از شماره تلفن همراه یا نشانی پست الکترونیکی دیگران پیگرد قانونی دارد و آگهی دهنده مسئول آن تلقی شده و ایرابیست در این مورد هیچ گونه مسئولیتی ندارد.

شرایط تصاویر آگهی‌ها
پیشنهاد می‌کنیم همواره از تصاویر واقعی، باکیفیت و مرتبط با کالا یا خدمتی که ارائه می‌نمایید، استفاده کنید؛ اندازهٔ تصویر می‌بایست حداقل ۶۰۰*۶۰۰ و حجم آن حداکثر ۱۰ مگابایت باشد. چنانچه یک یا چند بند از موارد زیر برای تصویر آگهی شما صدق کند، تصویر منتشر نمی‌شود:



تصویر لوگو*،
تصویر بیش از حد کوچک یا بی‌کیفیت،
تصویر غیر واقعی،
تصویر دارای کادری سیاه (یا سایر رنگ‌ها)،
مغایرت محتوای تصویر با شرایط عرف جامعه و یا قوانین جمهوری اسلامی،
استفاده ابزاری از تصاویر اشخاص در آگهی
تصویری که متعلق به آگهی دیگری در ایرابیست باشد،
تصویری که به آگهی مرتبط نباشد،
بیش از ۲۰٪ از محتوایِ تصویر آگهی شامل متن باشد،
تصویر نیاز به چرخش داشته باشد،
در تصویر آگهی عبارت‌های تبلیغاتی یا واژه‌هایی مانند:‌ حراج و … نوشته شده باشد،
تصاویری که دارای شماره تماس، ایمیل یا آدرس سایت باشند،
*در دسته‌بندی استخدام و کاریابی و همچنین دسته‌بندی خدمات امکان ثبت تصویر لوگوی شرکت و مجموعه وجود دارد.



شرایط مشاهده و استفاده از آگهی‌ها
هرگونه استفاده از ایرابیست به معنی پذیرفتن شرایط مندرج در این سایت است. ایرابیست هیچ توافقی با کاربران خارج از این شرایط ندارد. شرایط زیر مربوط به کسانی است که به هر شکلی از آگهی‌های منتشر شده‌ٔ ایرابیست استفاده می‌کنند.

تلاش ایرابیست، نشر آگهی‌ها با اطلاعات صحیح و درست است اما نمی‌تواند صحت آگهی‌ها را تضمین نماید و هیچ‌گونه تعهد یا مسئولیتی در قبال آگهی‌ها برعهده نمی‌گیرد.
مسئولیت استفاده از آگهی‌های این سایت بر عهدهٔ شماست و ایرابیست هیچ تعهدى در قبال خسارات مستقیم، اتفاقى، تبعى، غیرمستقیم و کیفرى، ناشى از دسترسى و استفادهٔ شما از این سایت ندارد.
ایرابیست هیچ قرارداد، تعهدنامه یا سندی را با آگهی‌دهندگان حقیقی یا حقوقی منعقد نمی‌کند. کاربرانِ ایرابیست در هر لحظه قادر به ویرایش آگهی خود هستند، بنابراین ایرابیست، هیچ‌گونه مسئولیتی را در قبال هر نوع آگهی درج شده در سایت نمی‌پذیرد و صرفاً مطالب درج شده توسط کاربران را نمایش می‌دهد.
مسئولیت استفاده از هرگونه متن، پیام، توضیح، اطلاعات، عکس، مشخصات تماس و موارد مشابه که به ایرابیست ارسال می‌شود یا در آن قرار می‌گیرد، شامل بازتولید، افشاء، مخابره، نشر و پخش آن بر عهدهٔ فرستنده اطلاعات است.
ایرابیست مختار است هر گونه پیام، آگهی یا عکسی که به این سایت ارسال می‌کنید یا هر حساب کاربری و اطلاعات دیگری که مربوط به شما یا ایجاد شده توسط شما باشد را هر زمانی و به هر شکلی که ضروری بداند حذف نماید.
مسئولیت هر لینک، مطلب و ادعایی مربوط به ایرابیست که به واسطه‌ٔ اشخاص حقیقی و حقوقی دیگر در سایت، بلاگ یا شبکه‌های اجتماعی و باقی رسانه‌ها منتشر می‌شود، با خود این افراد است و ایرابیست مسئولیتی در قبال آنها ندارد.
آگهی‌های ایرابیست با هزینه‌ٔ گردانندگان سایت جمع‌آوری، نظارت، مرتب‌سازی و توزیع شده است و حق حذف آگهی‌ها در هر زمان به ارسال‌کننده آگهی داده شده است. استفاده کننده از ایرابیست حق کپی‌برداری از اطلاعات آگهی‌دهنده، نوشتار و تصاویر آگهی‌های ارسال شده به ایرابیست را چه به شکل دستی و یا خودکار نخواهد داشت و انجام این موارد پیگرد قانونی دارد.
قوانین جمهوری اسلامی ایران بر تعبیر، تفسیر، اجرا و تأثیر این توافق‌نامه حاکم خواهند بود.






امن خرید کنید
از کسانی خرید کنید که امکان ملاقات حضوری با آنها پیش از انجام معامله وجود داشته باشد.
هرگز پیش از دریافت کالا هزینه‌ای پرداخت نکنید.
اگر فروشنده اطلاعات شخصی یا اطلاعات حساب بانکی خود را ارائه کرد،‌ دلیل کافی برای اعتماد شما به ایشان نیست؛ ممکن است اطلاعات شخص دیگری مورد سوء‌استفاده قرار گرفته باشد.
در صورت امکان، پس از خرید کالا رسید کتبی معتبر از فروشنده دریافت کنید.
بیشتر احتیاط کنید وقتی…
قیمت و شرایط ارائه شده بیش از حد عالی به نظر می‌رسد.
فروشنده یا خریداری که بی‌دلیل و به طرزی مشکوک اطلاعات حساب بانکی شما را می‌پرسد.
می‌خواهید مبلغ قابل توجهی به کسی که نمی‌شناسید، بپردازید. سعی کنید در محلی امن مانند پایگاه‌های پلیس یا شعب بانک‌ها قرار بگذارید.
به خاطر داشته باشید:
در خرید پستی، شما پیش از اطمینان از صحت کالا هزینه را پرداخت کرده‌اید که این مورد خالی از ریسک نیست و ما انجام آن را به هیچ عنوان توصیه نمی‌کنیم.
بهتر است نقدی معامله کنید. چک و سفته ممکن است نقد نشوند.
در مورد برخی کالاها بهتر است درخواست فاکتور خرید و احیاناً بسته‌بندی اولیه را از فروشنده داشته باشید.
بهتر است قبل از تحویل کالا یا خودروی خود در ازای چک‌های رمزدار بانکی، با مراجعه به بانک مربوط از اصالت آن اطمینان حاصل کنید.

در صورت ایجاد مزاحمت برای شما، می‌توانید با مراجعه به سایت پلیس فتا،‌ از اطلاعات تماس پلیس فتای محل سکونت خود آگاه شده و موضوع را از آن طریق پیگیری کنید
                </Text>
              </Body>
            </CardItem>
            <CardItem>

            </CardItem>
          </Card>
          <Card>
            {this.renderGobutton()}
          </Card>
          <Card>
            <CheckBox
    title='قوانین و مقررات ایرابیست را قبول دارم'
    checked={this.state.checked}
    onPress={() => this.setcheckbox()}
  />
          </Card>

        </Content>
      </Container>
    );
  }
}


const styles = StyleSheet.create({

  rollstext:{
    textAlign:'right',
    justifyContent: 'center',
    alignItems: 'center'
  },

});
